zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_timer.c
/*!
    \brief      configure TIMER break function (API_ID(0x001BU))
    \param[in]  timer_periph: TIMERx(x=0,15,16)
    \param[in]  breakpara: TIMER break parameter struct
                  runoffstate: TIMER_ROS_STATE_ENABLE,TIMER_ROS_STATE_DISABLE
                  ideloffstate: TIMER_IOS_STATE_ENABLE,TIMER_IOS_STATE_DISABLE
                  deadtime: 0~255
                  outputautostate: TIMER_OUTAUTO_ENABLE,TIMER_OUTAUTO_DISABLE
                  protectmode: TIMER_CCHP_PROT_OFF,TIMER_CCHP_PROT_0,TIMER_CCHP_PROT_1,TIMER_CCHP_PROT_2
                  break0state: TIMER_BREAK0_ENABLE, TIMER_BREAK0_DISABLE
                  break0filter: 0~15
                  break0polarity: TIMER_BREAK0_POLARITY_LOW, TIMER_BREAK0_POLARITY_HIGH
                  break1state: TIMER_BREAK1_ENABLE, TIMER_BREAK1_DISABLE
                  break1filter: 0~15
                  break1polarity: TIMER_BREAK1_POLARITY_LOW, TIMER_BREAK1_POLARITY_HIGH
    \param[out] none
    \retval     none
*/
void timer_break_config(uint32_t timer_periph, timer_break_parameter_struct* breakpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(breakpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x001BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((TIMER0 == timer_periph) ) {
        TIMER_CCHP(timer_periph) = ((((uint32_t)(breakpara->runoffstate) &TIMER_ROS_STATE_ENABLE))|
                                              (((uint32_t)(breakpara->ideloffstate) &TIMER_IOS_STATE_ENABLE))|
                                              (((uint32_t)(breakpara->deadtime)&DEADTIME_MASK))|
                                              (((uint32_t)(breakpara->outputautostate) &TIMER_OUTAUTO_ENABLE))|
                                              (((uint32_t)(breakpara->break0state) &TIMER_BREAK0_ENABLE)) |
                                              (((uint32_t)(breakpara->break0filter << 16U)&BREAK0FILTER_MASK)) |
                                              (((uint32_t)(breakpara->break0polarity) &TIMER_BREAK0_POLARITY_HIGH))|
                                              (((uint32_t)(breakpara->break1state) &TIMER_BREAK1_ENABLE)) |
                                              (((uint32_t)(breakpara->break1filter << 20U)&BREAK1FILTER_MASK)) |
                                              (((uint32_t)(breakpara->break1polarity) & TIMER_BREAK1_POLARITY_HIGH))|
                                              (((uint32_t)(breakpara->protectmode)&TIMER_CCHP_PROT_2))) ;
        } else if((TIMER15 == timer_periph) || (TIMER16 == timer_periph)) {
            TIMER_CCHP(timer_periph) = ((((uint32_t)(breakpara->runoffstate) &TIMER_ROS_STATE_ENABLE))|
                                              (((uint32_t)(breakpara->ideloffstate) &TIMER_IOS_STATE_ENABLE))|
                                              (((uint32_t)(breakpara->deadtime)&DEADTIME_MASK))|
                                              (((uint32_t)(breakpara->outputautostate) &TIMER_OUTAUTO_ENABLE))|
                                              (((uint32_t)(breakpara->break0state) &TIMER_BREAK0_ENABLE)) |
                                              (((uint32_t)(breakpara->break0filter << 16U)&BREAK0FILTER_MASK)) |
                                              (((uint32_t)(breakpara->break0polarity) &TIMER_BREAK0_POLARITY_HIGH))|
                                              (((uint32_t)(breakpara->protectmode)&TIMER_CCHP_PROT_2))) ;
        } else {
            /* illegal parameters */
        }
        }
}

/*!
    \brief      enable TIMER break function (API_ID(0x001CU))
    \param[in]  timer_periph: TIMERx(x=0,15,16)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signals, TIMERx(x=0,15,16)
      \arg        TIMER_BREAK1: BREAK1 input signals, TIMERx(x=0)
    \param[out] none
    \retval     none
*/
void timer_break_enable(uint32_t timer_periph, uint16_t break_num)
{
    if(TIMER_BREAK0 == break_num) {
      TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK0EN;
    } else if(TIMER0 == timer_periph) {
        TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK1EN;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      disable TIMER break function (API_ID(0x001DU))
    \param[in]  timer_periph: TIMERx(x=0,15,16)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signals, TIMERx(x=0,15,16)
      \arg        TIMER_BREAK1: BREAK1 input signals, TIMERx(x=0)
    \param[out] none
    \retval     none
*/
void timer_break_disable(uint32_t timer_periph, uint16_t break_num)
{
    if(TIMER_BREAK0 == break_num) {
      TIMER_CCHP(timer_periph) &= ~(uint32_t)TIMER_CCHP_BRK0EN;
    } else if(TIMER0 == timer_periph) {
        TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_BRK1EN);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      enable TIMER output automatic function (API_ID(0x001EU))
    \param[in]  timer_periph: TIMERx(x=0,15,16)
    \param[out] none
    \retval     none
*/
void timer_automatic_output_enable(uint32_t timer_periph)
{
    TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_OAEN;
}

/*!
    \brief      disable TIMER output automatic function (API_ID(0x001FU))
    \param[in]  timer_periph: TIMERx(x=0,15,16)
    \param[out] none
    \retval     none
*/
void timer_automatic_output_disable(uint32_t timer_periph)
{
    TIMER_CCHP(timer_periph) &= ~(uint32_t)TIMER_CCHP_OAEN;
}

/*!
    \brief      configure TIMER primary output function (API_ID(0x0020U))
    \param[in]  timer_periph: TIMERx(x=0,15,16)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_primary_output_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue){
        TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_POEN;
    }else{
        TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_POEN);
    }
}

/*!
    \brief      enable or disable channel capture/compare control shadow register  (API_ID(0x0021U))
    \param[in]  timer_periph: TIMERx(x=0,15,16)
    \param[in]  newvalue: ENABLE or DISABLE 
    \param[out] none
    \retval     none
*/
void timer_channel_control_shadow_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue){
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_CCSE;
    }else{
        TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCSE);
    }
}

/*!
    \brief      configure TIMER channel control shadow register update control (API_ID(0x0022U))
    \param[in]  timer_periph: TIMERx(x=0,15,16)
    \param[in]  ccuctl: channel control shadow register update control
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATECTL_CCU: the shadow registers update by when CMTG bit is set
      \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers update by when CMTG bit is set or an rising edge of TRGI occurs 
    \param[out] none
    \retval     none
*/              
void timer_channel_control_shadow_update_config(uint32_t timer_periph, uint32_t ccuctl)
{
        if(TIMER_UPDATECTL_CCU == ccuctl){
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCUC);
        }else if(TIMER_UPDATECTL_CCUTRI == ccuctl){
            TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_CCUC;
        }else{
            /* illegal parameters */        
        }
}

/*!
    \brief      initialize TIMER channel output parameter struct with a default value (API_ID(0x0023U))
    \param[in]  ocpara: TIMER channel n output parameter struct
    \param[out] none
    \retval     none
*/
void timer_channel_output_struct_para_init(timer_oc_parameter_struct *ocpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ocpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0023U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the channel output parameter struct member with the default value */
        ocpara->outputstate  = TIMER_CCX_DISABLE;
        ocpara->outputnstate = TIMER_CCXN_DISABLE;
        ocpara->ocpolarity   = TIMER_OC_POLARITY_HIGH;
        ocpara->ocnpolarity  = TIMER_OCN_POLARITY_HIGH;
        ocpara->ocidlestate  = TIMER_OC_IDLE_STATE_LOW;
        ocpara->ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
    }
}

/*!
    \brief      configure TIMER channel output function (API_ID(0x0024U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,2))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,2))
      \arg        TIMER_CH_4: TIMER channel 4(TIMERx(x=0))
    \param[in]  ocpara: TIMER channeln output parameter struct
                  outputstate: TIMER_CCX_ENABLE,TIMER_CCX_DISABLE
                  outputnstate: TIMER_CCXN_ENABLE,TIMER_CCXN_DISABLE
                  ocpolarity: TIMER_OC_POLARITY_HIGH,TIMER_OC_POLARITY_LOW
                  ocnpolarity: TIMER_OCN_POLARITY_HIGH,TIMER_OCN_POLARITY_LOW
                  ocidlestate: TIMER_OC_IDLE_STATE_LOW,TIMER_OC_IDLE_STATE_HIGH
                  ocnidlestate: TIMER_OCN_IDLE_STATE_LOW,TIMER_OCN_IDLE_STATE_HIGH
    \param[out] none
    \retval     none
*/
void timer_channel_output_config(uint32_t timer_periph, uint16_t channel, timer_oc_parameter_struct *ocpara)
{
    uint32_t ctl;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ocpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0024U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel){
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            TIMER_CHCTL0(timer_periph) &= ~(uint32_t)TIMER_CHCTL0_CH0MS;
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)ocpara->outputstate & TIMER_CCX_ENABLE);
            /* set the CH0P bit */
            ctl = TIMER_CHCTL2(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL2_CH0P);
            ctl |= ((uint32_t)ocpara->ocpolarity & TIMER_CHCTL2_CH0P);
            TIMER_CHCTL2(timer_periph) = ctl;
            if((TIMER0 == timer_periph) || (TIMER15 == timer_periph) || (TIMER16 == timer_periph)){
                /* reset the CH0NEN bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0NEN);
                /* set the CH0NEN bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)(ocpara->outputnstate & TIMER_CHCTL2_CH0NEN);
                /* reset the CH0NP bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0NP);
                /* set the CH0NP bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)(ocpara->ocnpolarity & TIMER_CHCTL2_CH0NP);
                /* reset the ISO0 bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO0);
                /* set the ISO0 bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)(ocpara->ocidlestate & TIMER_CTL1_ISO0);
                /* reset the ISO0N bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO0N);
                /* set the ISO0N bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)(ocpara->ocnidlestate & TIMER_CTL1_ISO0N);
            }
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            TIMER_CHCTL0(timer_periph) &= ~(uint32_t)TIMER_CHCTL0_CH1MS;
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (((uint32_t)ocpara->outputstate & TIMER_CCX_ENABLE) << 4U);
            /* set the CH1P bit */
            ctl = TIMER_CHCTL2(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL2_CH1P);
            ctl |= (uint32_t)(((uint32_t)ocpara->ocpolarity & TIMER_CHCTL2_CH0P) << 4U);
            TIMER_CHCTL2(timer_periph) = ctl;
            if(TIMER0 == timer_periph){
                /* reset the CH1NEN bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1NEN);
                /* set the CH1NEN bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->outputnstate & TIMER_CHCTL2_CH0NEN) << 4U);
                /* reset the CH1NP bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1NP);
                /* set the CH1NP bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocnpolarity & TIMER_CHCTL2_CH0NP) << 4U);
                /* reset the ISO1 bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1);
                /* set the ISO1 bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocidlestate & TIMER_CTL1_ISO0) << 2U);
                /* reset the ISO1N bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1N);
                /* set the ISO1N bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocnidlestate & TIMER_CTL1_ISO0N) << 2U);
            }
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            /* reset the CH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2EN);
            TIMER_CHCTL1(timer_periph) &= ~(uint32_t)TIMER_CHCTL1_CH2MS;
            /* set the CH2EN bit */
            TIMER_CHCTL2(timer_periph) |= (((uint32_t)ocpara->outputstate & TIMER_CCX_ENABLE) << 8U);
            /* set the CH2P bit */
            ctl = TIMER_CHCTL2(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL2_CH2P);
            ctl |= (((uint32_t)ocpara->ocpolarity & TIMER_CHCTL2_CH0P) << 8U);
            TIMER_CHCTL2(timer_periph) = ctl;
            if(TIMER0 == timer_periph){
                /* reset the CH2NEN bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2NEN);
                /* set the CH2NEN bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->outputnstate & TIMER_CHCTL2_CH0NEN) << 8U);
                /* reset the CH2NP bit */
                TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2NP);
                /* set the CH2NP bit */
                TIMER_CHCTL2(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocnpolarity & TIMER_CHCTL2_CH0NP) << 8U);
                /* reset the ISO2 bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2);
                /* set the ISO2 bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocidlestate & TIMER_CTL1_ISO0) << 4U);
                /* reset the ISO2N bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2N);
                /* set the ISO2N bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocnidlestate & TIMER_CTL1_ISO0N) << 4U);
            }
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            /* reset the CH3EN bit */
            TIMER_CHCTL2(timer_periph) &=(~(uint32_t)TIMER_CHCTL2_CH3EN);
            TIMER_CHCTL1(timer_periph) &= ~(uint32_t)TIMER_CHCTL1_CH3MS;
            /* set the CH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (((uint32_t)ocpara->outputstate & TIMER_CCX_ENABLE) << 12U);
            /* set the CH3P bit */
            ctl = TIMER_CHCTL2(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL2_CH3P);
            ctl |= (((uint32_t)ocpara->ocpolarity & TIMER_CHCTL2_CH0P) << 12U);
            TIMER_CHCTL2(timer_periph) = ctl;
            if(TIMER0 == timer_periph){
                /* reset the ISO3 bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO3);
                /* set the ISO3 bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocidlestate & TIMER_CTL1_ISO0) << 6U);
            }
            break;
        /* configure TIMER_CH_4 */
        case TIMER_CH_4:
            if(TIMER0 == timer_periph){
                /* reset the CH4EN bit */
                TIMER_CHCTL2(timer_periph) &=(~(uint32_t)TIMER_CHCTL2_CH4EN);
                /* set the CH4EN bit */
                TIMER_CHCTL2(timer_periph) |= (((uint32_t)ocpara->outputstate & TIMER_CCX_ENABLE) << 16U);
                /* set the CH4P bit */
                ctl = TIMER_CHCTL2(timer_periph);
                ctl &= (~(uint32_t)TIMER_CHCTL2_CH4P);
                ctl |= (((uint32_t)ocpara->ocpolarity & TIMER_CHCTL2_CH0P) << 16U);
                TIMER_CHCTL2(timer_periph) = ctl;
                /* reset the ISO4 bit */
                TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO4);
                /* set the ISO4 bit */
                TIMER_CTL1(timer_periph) |= (uint32_t)((uint32_t)(ocpara->ocidlestate & TIMER_CTL1_ISO0) << 8U);
            }
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER channel output compare mode (API_ID(0x0025U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
      \arg        TIMER_CH_4: TIMER channel4(TIMERx(x=0))
    \param[in]  ocmode: channel output compare mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_MODE_TIMING: timing mode(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_OC_MODE_ACTIVE: active mode(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_OC_MODE_INACTIVE: inactive mode(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_OC_MODE_TOGGLE: toggle mode(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_OC_MODE_LOW: force low mode(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_OC_MODE_HIGH: force high mode(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_OC_MODE_PWM0: PWM0 mode(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_OC_MODE_PWM1: PWM1 mode(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_OC_MODE_DELAYABLE_SPM0  : Delayable SPM mode 0(TIMERx(x=0,2))
      \arg        TIMER_OC_MODE_DELAYABLE_SPM1  : Delayable SPM mode 1(TIMERx(x=0,2))
      \arg        TIMER_OC_MODE_COMBINED_PWM0   : Combined PWM mode 0(TIMERx(x=0,2)) 
      \arg        TIMER_OC_MODE_COMBINED_PWM1   : Combined PWM mode 1(TIMERx(x=0,2))
      \arg        TIMER_OC_MODE_ASYMMETRIC_PWM0 : Asymmetric PWM mode 0(TIMERx(x=0,2))
      \arg        TIMER_OC_MODE_ASYMMETRIC_PWM1 : Asymmetric PWM mode 1(TIMERx(x=0,2))
    \param[out] none
    \retval     none
*/
void timer_channel_output_mode_config(uint32_t timer_periph, uint16_t channel, uint32_t ocmode)
{
    uint32_t ctl;
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        ctl = TIMER_CHCTL0(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL0_CH0COMCTL);
        ctl |= (uint32_t)(ocmode&TIMER_CHCTL0_CH0COMCTL);
        TIMER_CHCTL0(timer_periph) = ctl;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        ctl = TIMER_CHCTL0(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL0_CH1COMCTL);
        ctl |= (uint32_t)((uint32_t)(ocmode&TIMER_CHCTL0_CH0COMCTL) << 8U);
        TIMER_CHCTL0(timer_periph) = ctl;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        ctl = TIMER_CHCTL1(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL1_CH2COMCTL);
        ctl |= (uint32_t)(ocmode&TIMER_CHCTL1_CH2COMCTL);
        TIMER_CHCTL1(timer_periph) = ctl;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        ctl = TIMER_CHCTL1(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL1_CH3COMCTL);
        ctl |= (uint32_t)((uint32_t)(ocmode&TIMER_CHCTL1_CH2COMCTL) << 8U);
        TIMER_CHCTL1(timer_periph) = ctl;
        break;
    /* configure TIMER_CH_4 */
    case TIMER_CH_4:
        ctl = TIMER_CHCTL3(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL3_CH4COMCTL);
        ctl |= (uint32_t)(ocmode&TIMER_CHCTL3_CH4COMCTL);
        TIMER_CHCTL3(timer_periph) = ctl;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output combine mode (API_ID(0x0026U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0))
    \param[in]  state: channel combined_3_phase_pwm
                only one parameter can be selected which is shown as below:
      \arg        TIMER_COMBINE_CHANNEL_DISABLE: channel combined 3 phase disable
      \arg        TIMER_COMBINE_CHANNEL_ENABLE: channel combined 3 phase enable
    \param[out] none
    \retval     none
*/
void timer_channel_combined_3_phase_pwm_config(uint32_t timer_periph, uint16_t channel, uint32_t state)
{
    uint32_t ctl;
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        ctl = TIMER_CH4CV(timer_periph);
        ctl &= (~(uint32_t)TIMER_CH4CV_CCH4CH0);
        ctl |= (uint32_t)((state & TIMER_COMBINE_CHANNEL_ENABLE) << 29U);
        TIMER_CH4CV(timer_periph) = ctl;
        break;
    case TIMER_CH_1:
        ctl = TIMER_CH4CV(timer_periph);
        ctl &= (~(uint32_t)TIMER_CH4CV_CCH4CH1);
        ctl |= (uint32_t)((state & TIMER_COMBINE_CHANNEL_ENABLE) << 30U);
        TIMER_CH4CV(timer_periph) = ctl;
        break;
    case TIMER_CH_2:
        ctl = TIMER_CH4CV(timer_periph);
        ctl &= (~(uint32_t)TIMER_CH4CV_CCH4CH2);
        ctl |= (uint32_t)((state & TIMER_COMBINE_CHANNEL_ENABLE) << 31U);
        TIMER_CH4CV(timer_periph) = ctl;
        break;
    default:
        break;
    }
}

