zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_timer.c
            /* reset the CH3P and CH3NP bits */
            ctl = TIMER_CHCTL2(timer_periph);
            ctl &= (~(uint32_t)(TIMER_CHCTL2_CH3P | TIMER_CHCTL2_CH3NP));
            ctl |= ((((uint32_t)icpara->icpolarity) & TIMER_IC_POLARITY_BOTH_EDGE) << 12U);
            TIMER_CHCTL2(timer_periph) = ctl;
            /* reset the CH3MS bit */
            ctl = TIMER_CHCTL1(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL1_CH3MS);
            ctl |= (uint32_t)((uint32_t)((icpara->icselection) & TIMER_CHCTL0_CH0MS) << 8U);
            TIMER_CHCTL1(timer_periph) = ctl;
            /* reset the CH3CAPFLT bit */
            ctl = TIMER_CHCTL1(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL1_CH3CAPFLT);
            ctl |= ((((uint32_t)icpara->icfilter) & 0XFU) << 12U);
            TIMER_CHCTL1(timer_periph) = ctl;
            /* set the CH3EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH3EN;
            break;
        default:
            break;
        }
        /* configure TIMER channel input capture prescaler value */
        timer_channel_input_capture_prescaler_config(timer_periph, channel, (uint16_t)(icpara->icprescaler));
    }
}

/*!
    \brief      configure TIMER channel input capture prescaler value (API_ID(0x0031U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[in]  prescaler: channel input capture prescaler value
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_PSC_DIV1: no prescaler
      \arg        TIMER_IC_PSC_DIV2: divided by 2
      \arg        TIMER_IC_PSC_DIV4: divided by 4
      \arg        TIMER_IC_PSC_DIV8: divided by 8
    \param[out] none
    \retval     none
*/
void timer_channel_input_capture_prescaler_config(uint32_t timer_periph, uint16_t channel, uint16_t prescaler)
{
    uint32_t ctl;
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        ctl = TIMER_CHCTL0(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL0_CH0CAPPSC);
        ctl |= ((uint32_t)prescaler & TIMER_CHCTL0_CH0CAPPSC);
        TIMER_CHCTL0(timer_periph) = ctl;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        ctl = TIMER_CHCTL0(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL0_CH1CAPPSC);
        ctl |= (((uint32_t)prescaler & TIMER_CHCTL0_CH0CAPPSC) << 8U);
        TIMER_CHCTL0(timer_periph) = ctl;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        ctl = TIMER_CHCTL1(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL1_CH2CAPPSC);
        ctl |= ((uint32_t)prescaler & TIMER_CHCTL0_CH0CAPPSC);
        TIMER_CHCTL1(timer_periph) = ctl;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        ctl = TIMER_CHCTL1(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL1_CH3CAPPSC);
        ctl |= (((uint32_t)prescaler & TIMER_CHCTL0_CH0CAPPSC) << 8U);
        TIMER_CHCTL1(timer_periph) = ctl;
        break;
    default:
        break;
    }
}

/*!
    \brief      read TIMER channel capture compare register value (API_ID(0x0032U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0(TIMERx(x=0,2,13,15,16))
      \arg        TIMER_CH_1: TIMER channel1(TIMERx(x=0,2))
      \arg        TIMER_CH_2: TIMER channel2(TIMERx(x=0,2))
      \arg        TIMER_CH_3: TIMER channel3(TIMERx(x=0,2))
    \param[out] none
    \retval     channel capture compare register value
*/
uint16_t timer_channel_capture_value_register_read(uint32_t timer_periph, uint16_t channel)
{
    uint16_t count_value = 0U;
    switch(channel) {
    /* read TIMER channel 0 capture compare register value */
    case TIMER_CH_0:
        count_value = (uint16_t)TIMER_CH0CV(timer_periph);
        break;
    /* read TIMER channel 1 capture compare register value */
    case TIMER_CH_1:
        count_value = (uint16_t)TIMER_CH1CV(timer_periph);
        break;
    /* read TIMER channel 2 capture compare register value */
    case TIMER_CH_2:
        count_value = (uint16_t)TIMER_CH2CV(timer_periph);
        break;
    /* read TIMER channel 3 capture compare register value */
    case TIMER_CH_3:
        count_value = (uint16_t)TIMER_CH3CV(timer_periph);
        break;
    default:
        break;
    }
    return (count_value);
}

/*!
    \brief      configure TIMER input pwm capture function (API_ID(0x0033U))
    \param[in]  timer_periph: TIMERx(x=0,2,13,15,16)
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0
      \arg        TIMER_CH_1: TIMER channel1
     \param[in]  icpwm:TIMER channel intput pwm parameter struct
                 icpolarity: TIMER_IC_POLARITY_RISING,TIMER_IC_POLARITY_FALLING
                 icselection: TIMER_IC_SELECTION_DIRECTTI,TIMER_IC_SELECTION_INDIRECTTI
                 icprescaler: TIMER_IC_PSC_DIV1,TIMER_IC_PSC_DIV2,TIMER_IC_PSC_DIV4,TIMER_IC_PSC_DIV8
                 icfilter: 0~15
    \param[out] none
    \retval     none
*/
void timer_input_pwm_capture_config(uint32_t timer_periph, uint16_t channel, timer_ic_parameter_struct *icpwm)
{
    uint32_t ctl;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(icpwm)) {
        fw_debug_report_err(TIMER_MODULE_ID, API_ID(0x0033U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint16_t icpolarity;
        uint16_t icselection;

        /* Set channel input polarity */
        if(TIMER_IC_POLARITY_RISING == icpwm->icpolarity) {
            icpolarity = TIMER_IC_POLARITY_FALLING;
        } else {
            icpolarity = TIMER_IC_POLARITY_RISING;
        }
        /* Set channel input mode selection */
        if(TIMER_IC_SELECTION_DIRECTTI == icpwm->icselection) {
            icselection = TIMER_IC_SELECTION_INDIRECTTI;
        } else {
            icselection = TIMER_IC_SELECTION_DIRECTTI;
        }

        if(TIMER_CH_0 == channel) {
            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            /* set the CH0P and CH0NP bits */
            ctl = TIMER_CHCTL2(timer_periph);
            ctl &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
            ctl |= (((uint32_t)icpwm->icpolarity) & TIMER_IC_POLARITY_BOTH_EDGE);
            TIMER_CHCTL2(timer_periph) = ctl;
            /* set the CH0MS bit */
            ctl = TIMER_CHCTL0(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
            ctl |= (uint32_t)((icpwm->icselection) & TIMER_CHCTL0_CH0MS);
            TIMER_CHCTL0(timer_periph) = ctl;
            /* set the CH0CAPFLT bit */
            ctl = TIMER_CHCTL0(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            ctl |= ((((uint32_t)icpwm->icfilter) & 0xFU) << 4U);
            TIMER_CHCTL0(timer_periph) = ctl;
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph, TIMER_CH_0, (uint16_t)((icpwm->icprescaler) & TIMER_IC_PSC_DIV8));

            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            /* set the CH1P and CH1NP bits */
            ctl = TIMER_CHCTL2(timer_periph);
            ctl &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
            ctl |= (((uint32_t)icpolarity & TIMER_IC_POLARITY_BOTH_EDGE) << 4U);
            TIMER_CHCTL2(timer_periph) = ctl;

            /* set the CH1MS bit */
            ctl = TIMER_CHCTL0(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
            ctl |= (((uint32_t)icselection & TIMER_CHCTL0_CH0MS) << 8U);
            TIMER_CHCTL0(timer_periph) = ctl;

            /* set the CH1CAPFLT bit */
            ctl = TIMER_CHCTL0(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            ctl |= ((((uint32_t)icpwm->icfilter) & 0xFU) << 12U);
            TIMER_CHCTL0(timer_periph) = ctl;

