zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_timer.c
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph, TIMER_CH_1, (uint16_t)((icpwm->icprescaler) & TIMER_IC_PSC_DIV8));
        } else {
            /* reset the CH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
            /* set the CH1P and CH1NP bits */
            ctl = TIMER_CHCTL2(timer_periph);
            ctl &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
            ctl |= ((((uint32_t)icpwm->icpolarity) & TIMER_IC_POLARITY_BOTH_EDGE) << 4U);
            TIMER_CHCTL2(timer_periph) = ctl;
            /* set the CH1MS bit */
            ctl = TIMER_CHCTL0(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
            ctl |= ((((uint32_t)icpwm->icselection) &TIMER_CHCTL0_CH0MS) << 8U);
            TIMER_CHCTL0(timer_periph) = ctl;
            /* set the CH1CAPFLT bit */
            ctl = TIMER_CHCTL0(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
            ctl |= ((((uint32_t)icpwm->icfilter) & 0xFU) << 12U);
            TIMER_CHCTL0(timer_periph) = ctl;
            /* set the CH1EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph, TIMER_CH_1, (uint16_t)((icpwm->icprescaler)& TIMER_IC_PSC_DIV8));

            /* reset the CH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
            /* set the CH0P and CH0NP bits */
            ctl = TIMER_CHCTL2(timer_periph);
            ctl &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
            ctl |= ((uint32_t)icpolarity & TIMER_IC_POLARITY_BOTH_EDGE);
            TIMER_CHCTL2(timer_periph) = ctl;
            /* set the CH0MS bit */
            ctl = TIMER_CHCTL0(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
            ctl |= ((uint32_t)icselection & TIMER_CHCTL0_CH0MS);
            TIMER_CHCTL0(timer_periph) = ctl;
            /* set the CH0CAPFLT bit */
            ctl = TIMER_CHCTL0(timer_periph);
            ctl &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
            ctl |= ((((uint32_t)icpwm->icfilter) & 0xFU) << 4U);
            TIMER_CHCTL0(timer_periph) = ctl;
            /* set the CH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0EN;
            /* configure TIMER channel input capture prescaler value */
            timer_channel_input_capture_prescaler_config(timer_periph, TIMER_CH_0, (uint16_t)((icpwm->icprescaler) & TIMER_IC_PSC_DIV8));
        }
    }
}

/*!
    \brief      configure TIMER hall sensor mode (API_ID(0x0034U))
    \param[in]  timer_periph: TIMERx(x=0,2)
    \param[in]  hallmode:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_HALLINTERFACE_ENABLE: TIMER hall sensor mode enable
      \arg        TIMER_HALLINTERFACE_DISABLE: TIMER hall sensor mode disable
    \param[out] none
    \retval     none
*/
void timer_hall_mode_config(uint32_t timer_periph, uint32_t hallmode)
{
    if(TIMER_HALLINTERFACE_ENABLE == hallmode) {
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_TI0S;
    } else {
        TIMER_CTL1(timer_periph) &= ~(uint32_t)TIMER_CTL1_TI0S;
    }
}

/*!
    \brief      select TIMER input trigger source (API_ID(0x0035U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  intrigger:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_NONE: internal trigger disable
      \arg        TIMER_SMCFG_TRGSEL_ITI0: internal trigger 0
      \arg        TIMER_SMCFG_TRGSEL_ITI2: internal trigger 2
      \arg        TIMER_SMCFG_TRGSEL_ITI3: internal trigger 3
      \arg        TIMER_SMCFG_TRGSEL_CI0F_ED: TI0 edge detector
      \arg        TIMER_SMCFG_TRGSEL_CI0FE0: filtered TIMER input 0
      \arg        TIMER_SMCFG_TRGSEL_CI1FE1: filtered TIMER input 1
      \arg        TIMER_SMCFG_TRGSEL_ETIFP: external trigger
    \param[out] none
    \retval     none
*/
void timer_input_trigger_source_select(uint32_t timer_periph, uint32_t intrigger)
{
    uint32_t TIMERxCFG_temp0 = 0U,TIMERxCFG_temp1 = 0U;
    volatile uint32_t *TIMERxCFG_addr0, *TIMERxCFG_addr1;
    uint8_t i = 0U;
    switch(timer_periph){
    case TIMER0:
        TIMERxCFG_addr0 = &SYSCFG_TIMER0CFG0;
        TIMERxCFG_addr1 = &SYSCFG_TIMER0CFG1;
        break;
    case TIMER2:
        TIMERxCFG_addr0 = &SYSCFG_TIMER2CFG0;
        TIMERxCFG_addr1 = &SYSCFG_TIMER2CFG1;
        break;
    default:
        break;
    }
    TIMERxCFG_temp0 = REG32(TIMERxCFG_addr0);
    TIMERxCFG_temp1 = REG32(TIMERxCFG_addr1);
    if((TIMERxCFG_temp0 & 0xFFFFFFFFU) == 0U){
        TIMERxCFG_temp1 = (BITS(0,2) & intrigger);
        REG32(TIMERxCFG_addr1) = TIMERxCFG_temp1;
    }else{
        for(i = 0U; i < 8U; i++){
          if((TIMERxCFG_temp0 & (BITS(0,3) << (i * 4U))) != 0U){
              break;
          }
        }
        TIMERxCFG_temp0 = ((BITS(0,3) << (i * 4U)) & ((uint32_t)(intrigger) << (i * 4U)));
        REG32(TIMERxCFG_addr0) = TIMERxCFG_temp0;
    }
}

/*!
    \brief      select TIMER master mode output trigger source (API_ID(0x0036U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  outrigger:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_TRI_OUT_SRC_RESET: the UPG bit as trigger output (TIMERx(x=0,2))
      \arg        TIMER_TRI_OUT_SRC_ENABLE: the counter enable signal TIMER_CTL0_CEN as trigger output (TIMERx(x=0,2))
      \arg        TIMER_TRI_OUT_SRC_UPDATE: update event as trigger output (TIMERx(x=0,2))
      \arg        TIMER_TRI_OUT_SRC_CH0: a capture or a compare match occurred in channal0 as trigger output TRGO (TIMERx(x=0,2))
      \arg        TIMER_TRI_OUT_SRC_O0CPRE: O0CPRE as trigger output (TIMERx(x=0,2))
      \arg        TIMER_TRI_OUT_SRC_O1CPRE: O1CPRE as trigger output (TIMERx(x=0,2))
      \arg        TIMER_TRI_OUT_SRC_O2CPRE: O2CPRE as trigger output (TIMERx(x=0,2))
      \arg        TIMER_TRI_OUT_SRC_O3CPRE: O3CPRE as trigger output (TIMERx(x=0,2))
    \param[out] none
    \retval     none
*/
void timer_master_output_trigger_source_select(uint32_t timer_periph, uint32_t outtrigger)
{
    uint32_t ctl;
    ctl = TIMER_CTL1(timer_periph);
    ctl &= (~(uint32_t)TIMER_CTL1_MMC);
    ctl |= (uint32_t)(outtrigger & TIMER_CTL1_MMC);
    TIMER_CTL1(timer_periph) = ctl;
}

/*!
    \brief      select TIMER slave mode (API_ID(0x0037U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  slavemode:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SLAVE_MODE_DISABLE: slave mode disable
      \arg        TIMER_QUAD_DECODER_MODE0: quadrature decoder mode 0 (TIMERx(x=0,2))
      \arg        TIMER_QUAD_DECODER_MODE1: quadrature decoder mode 1 (TIMERx(x=0,2))
      \arg        TIMER_QUAD_DECODER_MODE2: quadrature decoder mode 2 (TIMERx(x=0,2))
      \arg        TIMER_SLAVE_MODE_RESTART: restart mode (TIMERx(x=0,2,13,15,16))
      \arg        TIMER_SLAVE_MODE_PAUSE: pause mode (TIMERx(x=0,2,13,15,16))
      \arg        TIMER_SLAVE_MODE_EVENT: event mode (TIMERx(x=0,2,13,15,16))
      \arg        TIMER_SLAVE_MODE_EXTERNAL0: external clock mode 0 (TIMERx(x=0,2,13,15,16))
      \arg        TIMER_SLAVE_MODE_RESTART_EVENT: restart + event mode (TIMERx(x=0,2,13,15,16))
    \param[out] none
    \retval     none
*/

void timer_slave_mode_select(uint32_t timer_periph, uint32_t slavemode)
{
    uint32_t TIMERxCFG_temp0 = 0U,TIMERxCFG_temp1 = 0U;
    volatile uint32_t *TIMERxCFG_addr0, *TIMERxCFG_addr1;
    uint32_t trigger_temp = 0U;
    uint8_t i = 0U;
    switch(timer_periph){
    case TIMER0:
        TIMERxCFG_addr0 = &SYSCFG_TIMER0CFG0;
        TIMERxCFG_addr1 = &SYSCFG_TIMER0CFG1;
        break;
    case TIMER2:
        TIMERxCFG_addr0 = &SYSCFG_TIMER2CFG0;
        TIMERxCFG_addr1 = &SYSCFG_TIMER2CFG1;
        break;
    default:
         break;
    }
    TIMERxCFG_temp0 = REG32(TIMERxCFG_addr0);
    TIMERxCFG_temp1 = REG32(TIMERxCFG_addr1);
    if((((TIMERxCFG_temp0 & 0xFFFFFFFFU) == 0U)&&(((TIMERxCFG_temp1 & 0xFFFFFFFFU)) == 0U))){
        if(slavemode == TIMER_SLAVE_MODE_DISABLE){
            REG32(TIMERxCFG_addr1) = BITS(0,2);
        }else{
            REG32(TIMERxCFG_addr0) = 0x7U << (slavemode * 4U);
        }
    }else if((TIMERxCFG_temp0 & 0xFFFFFFFFU) == 0U){
        if(slavemode != TIMER_SLAVE_MODE_DISABLE){
            trigger_temp = (TIMERxCFG_temp1 & BITS(0,2));
            TIMERxCFG_temp0 = trigger_temp << (slavemode * 4U);
            REG32(TIMERxCFG_addr0) = TIMERxCFG_temp0;
            REG32(TIMERxCFG_addr1) = 0U;
        }
    }else{
        for(i = 0U; i < 8U; i++){
            if((TIMERxCFG_temp0 & (BITS(0,2) << (i * 4U))) != 0U){
                trigger_temp = (TIMERxCFG_temp0 & (BITS(0,2) << (i * 4U))) >> (i * 4U);
                break;
            }
        }
        if(slavemode != TIMER_SLAVE_MODE_DISABLE){
            TIMERxCFG_temp0 = trigger_temp << (slavemode * 4U);
            REG32(TIMERxCFG_addr0) = TIMERxCFG_temp0;
            REG32(TIMERxCFG_addr1) = 0U;
        }else{
            TIMERxCFG_temp1 = trigger_temp;
            REG32(TIMERxCFG_addr0) = 0U;
            REG32(TIMERxCFG_addr1) = TIMERxCFG_temp1;
        }
    }
}

/*!
    \brief      configure TIMER master slave mode (API_ID(0x0038U))
    \param[in]  timer_periph: TIMERx(x=0,2,13,15,16)
    \param[in]  masterslave:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_MASTER_SLAVE_MODE_ENABLE: master slave mode enable
      \arg        TIMER_MASTER_SLAVE_MODE_DISABLE: master slave mode disable
    \param[out] none
    \retval     none
*/
void timer_master_slave_mode_config(uint32_t timer_periph, uint32_t masterslave)
{
    if(TIMER_MASTER_SLAVE_MODE_ENABLE == masterslave) {
        TIMER_SMCFG(timer_periph) |= (uint32_t)TIMER_SMCFG_MSM;
    } else if(TIMER_MASTER_SLAVE_MODE_DISABLE == masterslave) {
        TIMER_SMCFG(timer_periph) &= ~(uint32_t)TIMER_SMCFG_MSM;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure TIMER external trigger input (API_ID(0x0039U))
    \param[in]  timer_periph: TIMERx(x=0,2)
    \param[in]  extprescaler:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_EXT_TRI_PSC_OFF: no divided
      \arg        TIMER_EXT_TRI_PSC_DIV2: divided by 2
      \arg        TIMER_EXT_TRI_PSC_DIV4: divided by 4
      \arg        TIMER_EXT_TRI_PSC_DIV8: divided by 8
    \param[in]  extpolarity:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETP_FALLING: active low or falling edge active
      \arg        TIMER_ETP_RISING: active high or rising edge active
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_trigger_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter)
{
    uint32_t ctl;
    ctl = TIMER_SMCFG(timer_periph);
    ctl &= (~(uint32_t)(TIMER_SMCFG_ETP | TIMER_SMCFG_ETPSC | TIMER_SMCFG_ETFC));
    ctl |= (uint32_t)((extprescaler & TIMER_EXT_TRI_PSC_DIV8) | (extpolarity & TIMER_ETP_FALLING));
    ctl |= (((uint32_t)extfilter & 0xFU) << 8U);
    TIMER_SMCFG(timer_periph) = ctl;
}

/*!
    \brief      configure TIMER quadrature decoder mode (API_ID(0x003AU))
    \param[in]  timer_periph: TIMERx(x=0,2)
    \param[in]  decomode:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_QUAD_DECODER_MODE0: quadrature decoder mode 0 
      \arg        TIMER_QUAD_DECODER_MODE1: quadrature decoder mode 1
      \arg        TIMER_QUAD_DECODER_MODE2: quadrature decoder mode 2
    \param[in]  ic0polarity:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: capture rising edge
      \arg        TIMER_IC_POLARITY_FALLING: capture falling edge
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[in]  ic1polarity:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: capture rising edge
      \arg        TIMER_IC_POLARITY_FALLING: capture falling edge
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[out] none
    \retval     none
*/
void timer_quadrature_decoder_mode_config(uint32_t timer_periph, uint32_t decomode, uint16_t ic0polarity, uint16_t ic1polarity)
{
    uint32_t ctl;
    /* configure the quadrature decoder mode */
    timer_slave_mode_select(timer_periph, decomode);
    /* configure input capture selection */
    ctl = TIMER_CHCTL0(timer_periph);
    ctl &= (uint32_t)(((~(uint32_t)TIMER_CHCTL0_CH0MS)) & ((~(uint32_t)TIMER_CHCTL0_CH1MS)));
    ctl |= (uint32_t)(TIMER_IC_SELECTION_DIRECTTI | ((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U));
    TIMER_CHCTL0(timer_periph) = ctl;
    /* configure channel input capture polarity */
    ctl = TIMER_CHCTL2(timer_periph);
    ctl &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
    ctl &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
    ctl |= (((uint32_t)ic0polarity & TIMER_IC_POLARITY_BOTH_EDGE) | (((uint32_t)ic1polarity &TIMER_IC_POLARITY_BOTH_EDGE) << 4U));
    TIMER_CHCTL2(timer_periph) = ctl;
}

/*!
    \brief      configure TIMER internal clock mode (API_ID(0x003BU))
    \param[in]  timer_periph: TIMERx(x=0,2,13,15,16)
    \param[out] none
    \retval     none
*/
void timer_internal_clock_config(uint32_t timer_periph)
{
    timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_DISABLE);
}

/*!
    \brief      configure TIMER the internal trigger as external clock input(API_ID(0x003CU))
    \param[in]  timer_periph: TIMERx(x=0,2)
    \param[in]  intrigger: trigger selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_ITI0: internal trigger 0
      \arg        TIMER_SMCFG_TRGSEL_ITI1: internal trigger 1
      \arg        TIMER_SMCFG_TRGSEL_ITI2: internal trigger 2
      \arg        TIMER_SMCFG_TRGSEL_ITI3: internal trigger 3
    \param[out] none
    \retval     none
*/
void timer_internal_trigger_as_external_clock_config(uint32_t timer_periph, uint32_t intrigger)
{
    /* select TIMER input trigger source */
    timer_input_trigger_source_select(timer_periph, intrigger);
    /* select TIMER slave mode */
    timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_EXTERNAL0);
}

/*!
    \brief      configure TIMER the external trigger as external clock input(API_ID(0x003DU))
    \param[in]  timer_periph: TIMERx(x=0,2)
    \param[in]  extrigger: external trigger selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_CI0F_ED: TI0 edge detector
      \arg        TIMER_SMCFG_TRGSEL_CI0FE0: filtered TIMER input 0
      \arg        TIMER_SMCFG_TRGSEL_CI1FE1: filtered TIMER input 1
    \param[in]  extpolarity: external trigger polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_IC_POLARITY_RISING: active high or rising edge active
      \arg        TIMER_IC_POLARITY_FALLING: active low or falling edge active
      \arg        TIMER_IC_POLARITY_BOTH_EDGE: active both edge
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_trigger_as_external_clock_config(uint32_t timer_periph, uint32_t extrigger, uint16_t extpolarity, uint32_t extfilter)
{
    uint32_t ctl;
    if(TIMER_SMCFG_TRGSEL_CI1FE1 == extrigger) {
        /* reset the CH1EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
        /* set the CH1NP bit */
        ctl = TIMER_CHCTL2(timer_periph);
        ctl &= (~(uint32_t)(TIMER_CHCTL2_CH1P | TIMER_CHCTL2_CH1NP));
        ctl |= (((uint32_t)extpolarity & TIMER_IC_POLARITY_BOTH_EDGE) << 4U);
        TIMER_CHCTL2(timer_periph) = ctl;
        /* set the CH1MS bit */
        ctl = TIMER_CHCTL0(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
        ctl |= ((uint32_t)TIMER_IC_SELECTION_DIRECTTI << 8U);
        TIMER_CHCTL0(timer_periph) = ctl;
        /* set the CH1CAPFLT bit */
        ctl = TIMER_CHCTL0(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL0_CH1CAPFLT);
        ctl |= (((uint32_t)extfilter &0xFU) << 12U);
        TIMER_CHCTL0(timer_periph) = ctl;
        /* set the CH1EN bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH1EN;
    } else {
        /* reset the CH0EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
        /* set the CH0P and CH0NP bits */
        ctl = TIMER_CHCTL2(timer_periph);
        ctl &= (~(uint32_t)(TIMER_CHCTL2_CH0P | TIMER_CHCTL2_CH0NP));
        ctl |= ((uint32_t)extpolarity & TIMER_IC_POLARITY_BOTH_EDGE);
        TIMER_CHCTL2(timer_periph) = ctl;
        /* set the CH0MS bit */
        ctl = TIMER_CHCTL0(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
        ctl |= (uint32_t)TIMER_IC_SELECTION_DIRECTTI;
        TIMER_CHCTL0(timer_periph) = ctl;
        /* reset the CH0CAPFLT bit */
        ctl = TIMER_CHCTL0(timer_periph);
        ctl &= (~(uint32_t)TIMER_CHCTL0_CH0CAPFLT);
        ctl |= (((uint32_t)extfilter &0xFU) << 4U);
        TIMER_CHCTL0(timer_periph) = ctl;
        /* set the CH0EN bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)TIMER_CHCTL2_CH0EN;
    }
    /* select TIMER slave mode */
    timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_EXTERNAL0);
    /* select TIMER input trigger source */
    timer_input_trigger_source_select(timer_periph, extrigger);
}

/*!
    \brief      configure TIMER the external clock mode0 (API_ID(0x003EU))
    \param[in]  timer_periph: TIMERx(x=0,2,13,15,16)
    \param[in]  extprescaler:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_EXT_TRI_PSC_OFF: no divided
      \arg        TIMER_EXT_TRI_PSC_DIV2: divided by 2
      \arg        TIMER_EXT_TRI_PSC_DIV4: divided by 4
      \arg        TIMER_EXT_TRI_PSC_DIV8: divided by 8
    \param[in]  extpolarity:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETP_FALLING: active low or falling edge active
      \arg        TIMER_ETP_RISING: active high or rising edge active
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_clock_mode0_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter)
{
    /* configure TIMER external trigger input */
    timer_external_trigger_config(timer_periph, ((uint32_t)extprescaler & TIMER_EXT_TRI_PSC_DIV8), ((uint32_t)extpolarity & TIMER_ETP_FALLING), ((uint32_t)extfilter & 0xFU));
    /* select TIMER slave mode */
    timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_EXTERNAL0);
    /* select TIMER input trigger source */
    timer_input_trigger_source_select(timer_periph, TIMER_SMCFG_TRGSEL_ETIFP);
}

/*!
    \brief      configure TIMER the external clock mode1 (API_ID(0x003FU))
    \param[in]  timer_periph: TIMERx(x=0,2)
    \param[in]  extprescaler:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_EXT_TRI_PSC_OFF: no divided
      \arg        TIMER_EXT_TRI_PSC_DIV2: divided by 2
      \arg        TIMER_EXT_TRI_PSC_DIV4: divided by 4
      \arg        TIMER_EXT_TRI_PSC_DIV8: divided by 8
    \param[in]  extpolarity:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETP_FALLING: active low or falling edge active
      \arg        TIMER_ETP_RISING: active high or rising edge active
    \param[in]  extfilter: a value between 0 and 15
    \param[out] none
    \retval     none
*/
void timer_external_clock_mode1_config(uint32_t timer_periph, uint32_t extprescaler, uint32_t extpolarity, uint32_t extfilter)
{
    /* configure TIMER external trigger input */
    timer_external_trigger_config(timer_periph, ((uint32_t)extprescaler & TIMER_EXT_TRI_PSC_DIV8), ((uint32_t)extpolarity & TIMER_ETP_FALLING), (extfilter & 0xFU));
    TIMER_SMCFG(timer_periph) |= (uint32_t)TIMER_SMCFG_SMC1;
}

/*!
    \brief      disable TIMER the external clock mode1 (API_ID(0x0040U))
    \param[in]  timer_periph: TIMERx(x=0,2)
    \param[out] none
    \retval     none
*/
void timer_external_clock_mode1_disable(uint32_t timer_periph)
{
    TIMER_SMCFG(timer_periph) &= ~(uint32_t)TIMER_SMCFG_SMC1;
}


/*!
    \brief      configure TIMER input selection (API_ID(0x0041U))
    \param[in]  timer_periph: TIMERx(x=0,13,15,16)
    \param[in]  channel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel0
      \arg        TIMER_CH_1: TIMER channel1
    \param[in]  insel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INSEL_CHx: connect to CH0
      \arg        TIMER_INSEL_CMPx: connect to CMP1
    \param[out] none
    \retval     none
*/
void timer_input_selection_config(uint32_t timer_periph, uint16_t channel, uint16_t insel)
{
    if(TIMER_CH_0 == channel) {
        TIMER_INSEL(timer_periph) &= ~(uint32_t)TIMER_INSEL_CI0_SEL;
        TIMER_INSEL(timer_periph) |= (uint32_t) (insel & TIMER_INSEL_CI0_SEL);
    }else{
        TIMER_INSEL(timer_periph) &= ~(uint32_t)TIMER_INSEL_CI1_SEL;
        TIMER_INSEL(timer_periph) |= (uint32_t) ((uint32_t)(insel & TIMER_INSEL_CI1_SEL) << 8U);
    }
}
/*!
    \brief      configure TIMER write CHxVAL register selection (API_ID(0x0042U))
    \param[in]  timer_periph: TIMERx(x=0,2,13,15,16)
    \param[in]  ccsel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CHVSEL_DISABLE: no effect
      \arg        TIMER_CHVSEL_ENABLE: when write the CHxVAL register, if the write value is same as the CHxVAL value, the write access is ignored
    \param[out] none
    \retval     none
*/
void timer_write_chxval_register_config(uint32_t timer_periph, uint16_t ccsel)
{
    if(TIMER_CHVSEL_ENABLE == ccsel) {
        TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CHVSEL;
    } else if(TIMER_CHVSEL_DISABLE == ccsel) {
        TIMER_CFG(timer_periph) &= ~(uint32_t)TIMER_CFG_CHVSEL;
    } else {
        /* illegal parameters */
    }
}

