zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_timer.c
/*!
    \brief      configure TIMER output value selection (API_ID(0x0043U))
    \param[in]  timer_periph: TIMERx(x=0,2,13,15,16)
    \param[in]  outsel:
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OUTSEL_DISABLE: no effect
      \arg        TIMER_OUTSEL_ENABLE: if POEN and IOS is 0, the output disabled
    \param[out] none
    \retval     none
*/
void timer_output_value_selection_config(uint32_t timer_periph, uint16_t outsel)
{
    if(TIMER_OUTSEL_ENABLE == outsel) {
        TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_OUTSEL;
    } else if(TIMER_OUTSEL_DISABLE == outsel) {
        TIMER_CFG(timer_periph) &= ~(uint32_t)TIMER_CFG_OUTSEL;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure the TIMER break source (API_ID(0x0044U))
    \param[in]  timer_periph: TIMERx(x=0,15,16)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signal, TIMERx(x=0,15,16)
      \arg        TIMER_BREAK1: BREAK1 input signal, TIMERx(x=0)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_break_external_source_config(uint32_t timer_periph, uint16_t break_num, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        if(TIMER_BREAK0 == break_num) {
            TIMER_AFCTL0(timer_periph) |= TIMER_AFCTL0_BRK0INEN;
        } else if(TIMER_BREAK1 == break_num) {
            TIMER_AFCTL1(timer_periph) |= TIMER_AFCTL1_BRK1INEN;
        } else {
                /* illegal parameters */
        }
    } else {
        if(TIMER_BREAK0 == break_num) {
            TIMER_AFCTL0(timer_periph) &= (~TIMER_AFCTL0_BRK0INEN);
        } else if(TIMER_BREAK1 == break_num) {
            TIMER_AFCTL1(timer_periph) &= (~TIMER_AFCTL1_BRK1INEN);
        } else {
                /* illegal parameters */
        }
    }
}

/*!
    \brief      configure TIMER break polarity (API_ID(0x0045U))
    \param[in]  timer_periph: TIMERx(x=0,15,16)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signal, TIMERx(x=0,15,16)
      \arg        TIMER_BREAK1: BREAK1 input signal, TIMERx(x=0)
    \param[in]  bkinpolarity: break polarity
                only one parameter can be selected which is shown as below:
                  TIMER_BRKIN_POLARITY_LOW: input signal will not be inverted
                  TIMER_BRKIN_POLARITY_HIGH: input signal will be inverted
    \param[out] none
    \retval     none
*/
void timer_break_external_polarity_config(uint32_t timer_periph, uint16_t break_num, uint16_t bkinpolarity)
{
    if(TIMER_BREAK0 == break_num) {
        TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_AFCTL0_BRK0INP);
        TIMER_AFCTL0(timer_periph) |= (((uint32_t)bkinpolarity &TIMER_BRKIN_POLARITY_HIGH) << 9U);
    }else{
        TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_AFCTL1_BRK1INP);
        TIMER_AFCTL1(timer_periph) |= (((uint32_t)bkinpolarity &TIMER_BRKIN_POLARITY_HIGH) << 9U);
    }
}


/*!
    \brief      configure TIMER eti source (API_ID(0x0046U))
    \param[in]  timer_periph: TIMERx(x=0)
    \param[in]  eti_source: eti source select
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ETI_LEGACY_MODE : input signal, TIMERx(x=0)
      \arg        TIMER_ETI_ADC_WD0_OUT input signal, TIMERx(x=0)
      \arg        TIMER_ETI_ADC_WD1_OUT input signal, TIMERx(x=0)
      \arg        TIMER_ETI_ADC_WD2_OUT input signal, TIMERx(x=0)
    \param[out] none
    \retval     none
*/
void timer_eti_source_selection_config(uint32_t timer_periph, uint32_t eti_source)
{
   TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_AFCTL0_ETISEL);
   TIMER_AFCTL0(timer_periph) |= ((uint32_t)eti_source &TIMER_AFCTL0_ETISEL);
}

/*!
    \brief      get TIMER flags (API_ID(0x0047U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_FLAG_CH0: channel 0 flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_FLAG_CH1: channel 1 flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_FLAG_CH2: channel 2 flag,TIMERx(x=0,2)
      \arg        TIMER_FLAG_CH3: channel 3 flag,TIMERx(x=0,2)
      \arg        TIMER_FLAG_CH4: channel 3 flag,TIMERx(x=0)
      \arg        TIMER_FLAG_CMT: channel commutation flag, TIMERx(x=0)
      \arg        TIMER_FLAG_TRG: trigger flag,TIMERx(x=0,2)
      \arg        TIMER_FLAG_BRK0: BREAK0 flag, TIMERx(x=0,15,16)
      \arg        TIMER_FLAG_BRK1: BREAK1 flag, TIMERx(x=0)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag,TIMERx(x=0,2)
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag,TIMERx(x=0,2)
      \arg        TIMER_FLAG_SYSB: channel 3 system source break,TIMERx(x=0)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_flag_get(uint32_t timer_periph, uint32_t flag)
{
    FlagStatus timer_flag = RESET;
    if((uint32_t)RESET != (TIMER_INTF(timer_periph) & flag)) {
        timer_flag = SET;
    } else {
        timer_flag = RESET;
    }
    return timer_flag;
}

/*!
    \brief      clear TIMER flags (API_ID(0x0048U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_FLAG_CH0: channel 0 flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_FLAG_CH1: channel 1 flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_FLAG_CH2: channel 2 flag,TIMERx(x=0,2)
      \arg        TIMER_FLAG_CH3: channel 3 flag,TIMERx(x=0,2)
      \arg        TIMER_FLAG_TRG: trigger flag,TIMERx(x=0,2)
      \arg        TIMER_FLAG_BRK0: BREAK0 flag, TIMERx(x=0,15,16)
      \arg        TIMER_FLAG_BRK1: BREAK1 flag, TIMERx(x=0)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag,TIMERx(x=0,2)
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag,TIMERx(x=0,2)
      \arg        TIMER_FLAG_SYSB: channel 3 system source break,TIMERx(x=0)
    \param[out] none
    \retval     none
*/
void timer_flag_clear(uint32_t timer_periph, uint32_t flag)
{
    TIMER_INTF(timer_periph) = (~(uint32_t)flag);
}

/*!
    \brief      enable the TIMER interrupt (API_ID(0x0049U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  interrupt: timer interrupt enable source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_UP: update interrupt enable, TIMERx(x=0,2,3,6,8,11)
      \arg        TIMER_INT_CH0: channel 0 interrupt enable, TIMERx(x=0,2,13,15,16)
      \arg        TIMER_INT_CH1: channel 1 interrupt enable, TIMERx(x=0,2,13,15,16)
      \arg        TIMER_INT_CH2: channel 2 interrupt enable, TIMERx(x=0,2)
      \arg        TIMER_INT_CH3: channel 3 interrupt enable, TIMERx(x=0,2)
      \arg        TIMER_INT_CMT: commutation interrupt enable, TIMERx(x=0,15,16)
      \arg        TIMER_INT_TRG: trigger interrupt enable, TIMERx(x=0,2)
      \arg        TIMER_INT_BRK: break interrupt enable, TIMERx(x=0,15,16)
    \param[out] none
    \retval     none
*/
void timer_interrupt_enable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_DMAINTEN(timer_periph) |= (uint32_t) (interrupt & 0xFFU);
}

/*!
    \brief      disable the TIMER interrupt (API_ID(0x0050U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  interrupt: timer interrupt source disable
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_UP: update interrupt enable, TIMERx(x=0,2,3,6,8,11)
      \arg        TIMER_INT_CH0: channel 0 interrupt enable, TIMERx(x=0,2,13,15,16)
      \arg        TIMER_INT_CH1: channel 1 interrupt enable, TIMERx(x=0,2,13,15,16)
      \arg        TIMER_INT_CH2: channel 2 interrupt enable, TIMERx(x=0,2)
      \arg        TIMER_INT_CH3: channel 3 interrupt enable, TIMERx(x=0,2)
      \arg        TIMER_INT_CMT: commutation interrupt enable, TIMERx(x=0,15,16)
      \arg        TIMER_INT_TRG: trigger interrupt enable, TIMERx(x=0,2)
      \arg        TIMER_INT_BRK: break interrupt enable, TIMERx(x=0,15,16)
    \param[out] none
    \retval     none
*/
void timer_interrupt_disable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_DMAINTEN(timer_periph) &= (~(uint32_t)(interrupt & 0xFFU));
}

/*!
    \brief      get timer interrupt flag (API_ID(0x0051U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  int_flag: the timer interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_INT_FLAG_CH0: channel 0 interrupt flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_INT_FLAG_CH1: channel 1 interrupt flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_INT_FLAG_CH2: channel 2 interrupt flag,TIMERx(x=0,2)
      \arg        TIMER_INT_FLAG_CH3: channel 3 interrupt flag,TIMERx(x=0,2)
      \arg        TIMER_INT_FLAG_CMT: trigger interrupt flag,TIMERx(x=0,2)
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag,TIMERx(x=0,2)
      \arg        TIMER_INT_FLAG_BRK0: trigger interrupt flag,TIMERx(x=0,15,16)
      \arg        TIMER_INT_FLAG_BRK1: trigger interrupt flag,TIMERx(x=0)
      \arg        TIMER_INT_FLAG_SYSB: trigger interrupt flag,TIMERx(x=0,15,16)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_interrupt_flag_get(uint32_t timer_periph, uint32_t int_flag)
{
    FlagStatus timer_interrupt_flag = RESET;
        uint32_t val;
    if( int_flag != TIMER_INT_FLAG_BRK1 ) {
      val = (TIMER_DMAINTEN(timer_periph) & int_flag);
    }
    else {
      val = (TIMER_DMAINTEN(timer_periph) & TIMER_DMAINTEN_BRKIE );
    }
    if(((uint32_t)RESET != (TIMER_INTF(timer_periph) & int_flag)) && ((uint32_t)RESET != val)) {
        timer_interrupt_flag = SET;
    } else {
        timer_interrupt_flag = RESET;
    }
    return timer_interrupt_flag;
}

/*!
    \brief      get timer interrupt flag (API_ID(0x0052U))
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  int_flag: the timer interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_INT_FLAG_CH0: channel 0 interrupt flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_INT_FLAG_CH1: channel 1 interrupt flag,TIMERx(x=0,2,13,15,16)
      \arg        TIMER_INT_FLAG_CH2: channel 2 interrupt flag,TIMERx(x=0,2)
      \arg        TIMER_INT_FLAG_CH3: channel 3 interrupt flag,TIMERx(x=0,2)
      \arg        TIMER_INT_FLAG_CMT: trigger interrupt flag,TIMERx(x=0,2)
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag,TIMERx(x=0,2)
      \arg        TIMER_INT_FLAG_BRK0: trigger interrupt flag,TIMERx(x=0,15,16)
      \arg        TIMER_INT_FLAG_BRK1: trigger interrupt flag,TIMERx(x=0)
      \arg        TIMER_INT_FLAG_SYSB: trigger interrupt flag,TIMERx(x=0,15,16)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
void timer_interrupt_flag_clear(uint32_t timer_periph, uint32_t int_flag)
{
    TIMER_INTF(timer_periph) = (~(uint32_t)int_flag);
}
